[
  {
    "author": "Gwen",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functionally Solid",
    "content": "Build quality feels sub-par. It appears to be entirely plastic and not particularly sturdy.  They have little to no heft, which isn't entirely bad I suppose.These are quintessential closed-back headphones.The clamping force on your head is definitely stronger than average - could be too tight for people with bigger heads. Predictably the seal is very good which cancels out a lot of external noise.  The earpads are quite thick and soft which saves the day comfort-wise from the heavy clamp.  I'd probs give around a 4.5 on comfort overall.Sound quality is honestly not too shabby for $60 \"gamer\" headphones. The lower mids are a bit muddy but nothing close to the mess of my pretty-but-special Razer Kraken.  Certainly not my preferred headphones for music but not overtly offensive.  I didn't bother trying out the virtual 7.1 service yet because we really just play WoW, but I appreciate having the equalizer feature of the JBL software at my disposal.The microphone is what we're most impressed with: we have 2 PCs right next to each other and the one has a clicky mechanical keyboard that kept being picked up on the old neighboring headset making open mic a no-go. This headset picks up maybe 5% of the keystrokes tops which we're super pleased with. The flip to mute mic is a solid feature, though the click it makes to signify the transition is audible through the mic every time you mute w/ open mic on.The volume wheel placement kinda sucks. Its not intuitive to find nor to remember which way is up/down.  Fiance doesn't have a left hand so for them the dial may as well not exist, lol.I'd certainly recommend these for anyone that can take care of them.  I don't think they'd last a month of mild to moderate game rage or careless use, but I'm impressed by the both the sound and mic quality for the price point.",
    "date": "Reviewed in the United States on July 19, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "R. Peebles",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very comfortable and great sound quality!",
    "content": "Have owned this headset for two years now and use daily for work and play.  As with all JBLs I have ever had the sound was great and was very happy with the quality of the mic.  The mic flips up out of the way when not in use, and it mutes so dont forget to bring it back when you want it.If I had one complaint, it is that the cord is only 4ft long so occasionally I lean back and pop the cord out of my laptop!  Make it a 6ft cord and it would be perfect for a corded headset.",
    "date": "Reviewed in the United States on July 22, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Ash Bzak",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Comfy but hollow",
    "content": "I like the feel of these headphones and the audio quality is high enough for my liking (but I'm not audiophile). However, the big problem is the cord. Any rub on the cord travels up the headphones with no insulation to dampen the sound. It is extremely distracting the *wvimt wvimt* noise of the rub feels right in your ear. It makes the headphones feel cheap. Also, the mic feels like the adjustment will not perform well in the long haul, it just feels like it will snap at some point (something internal doesn't seem well made). They also don't do noise canceling despite the look, so you will still have some situational awareness depending on the volume you listen to. Bottomline, they are fine, I don't expect them to last long (not high quality), and if you move a lot when you are wearing them, these are not for you as the cord noise will be nearly insurmountably annoying.",
    "date": "Reviewed in the United States on July 31, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Amazon Customer",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good lightweight gaming headset for small heads",
    "content": "To preface, I have an extraordinarily small head. When I'm looking for headphones, I don't have the luxury of just picking the best quality or crispest sound or even best value... because most headphones do not size small enough to comfortably fit my head. I resort to earbuds in most situations, but I wanted a good mic'd headset for gaming/chatting online. I used to use a Turtlebeach wired headset, but when the mic broke, I thought I'd upgrade to a wireless set. Every wireless set I tried was way too bulky and heavy. Logitech's G935 fit me, but was so heavy it hurt my head and neck after a full day of wear.So I looked into bluetooth headphones. They have a built in microphone, not an arm and use bluetooth instead of a wireless dongle. I don't play many realtime competitive games, so I wasn't worried about delay. I figured I'd go big and got the Sennheiser PXC 550-II... Specifically because the biggest complaint on it was that it was too small for normal peoples' heads. I liked it at first, it's the first headset I could wear not on the smallest adjustment, but bluetooth does not play well with connecting to PCs. It worked great connected to my phone, but it would disconnect from Discord for no reason, would only play sound from one source (I couldn't hear game music and discord chat at the same time)... Also did I mention it was nearly $300? So I sent them back.I decided to give up on the quest for a wireless headset and look into good wired headsets. These were my choice. Their sound isn't top class, but they're also not $300, so I call that a win. I have no latency, my mic picks up sound clearly, they are lightweight and don't hurt my head, even when I wear them for nearly 10 hours straight (I use them for work and gaming), and best of all, they fit my dumb small head. On the smallest setting, of course, but they fit!My one gripe with them is that it has the \"flip to mute\" microphone and that doesn't always work. It's not a huge problem, but something to be aware of, especially if you're using it for work and think you're muted in a meeting...",
    "date": "Reviewed in the United States on August 13, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Daniel Spears",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gaming",
    "content": "Great quality fits great easy to use contect and great cord length easily great volume. Definitely would buy again worth the money",
    "date": "Reviewed in the United States on September 19, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Aiden gerving",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I was surprised.",
    "content": "At first, just using the Aux I was quite disappointed. The audio was quiet and had a somewhat muffled sound. When I plugged in the USB adapter and downloaded the JBL software. I messed with the equalizer to suit my preferences. there was a big difference there was a quality increase.  they have good bass I can feel them shaking on my head. I'm a bass head so that was a must when buying headphones. In the end, they're a great pair of headphones for the price. I can with confidence say you get what you pay for.",
    "date": "Reviewed in the United States on September 5, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Spencer",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for $30",
    "content": "Starting off simple:ProsGreat sound quality and bassNice usb or audio jack connection with adapterGood microphone quality with some tweakingVery comfortableHigh quality braided cordsConsFrame seems fragile and a little cheapFirst impressions of this headset are great. If you want great sound, spatial audio, and a good mic for budget $30 right now than this is a great option. The audio quality is as clear as AirPod pro 2s and it has more bass. The mic flipping up is very convenient. The only issue with the mic is that it picks up breathing even with the foam around it but honestly that shows how sensitive it is. Most games have mic level settings so this isn’t an issue and I didn’t mark these off at all for that. The plastic holding this together also seems a little fragile but with normal use and nothing crazy I think these will last a while. The cushions are also comfy so far and noise cancelling is decent. Overall great headset especially for the current price of $30",
    "date": "Reviewed in the United States on January 7, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Sibuna Salamander",
    "rating": "1.0 out of 5 stars",
    "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
    "content": "Great sound, bad material quality these headphones only lasted a month before they broke because i wasnt careful when i stood up to get a drink of water while my headset was connected to my controller the sound stopped working. I would not reccomend these to anyone the price tag is not justified and the crappy plastic feel these have is not worth the cash.",
    "date": "Reviewed in the United States on August 14, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Sammy Dowdle",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great audio.",
    "content": "The difference between this headset and other comparitable headsets is no competition. The spatial audio is amazing.",
    "date": "Reviewed in the United States on September 28, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Starlink Hardware",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't by the JBL's, get the HyperX Cloud series instead!",
    "content": "NOT RECOMMENDED! Long read but worth it to fully understand before you waste money!A little context for this review: I bought my first gaming headset about 4 years ago off Amazon for about $30. It was one of those cheap generic brand headsets that look cool but are pretty much junk. After about a year I decided to upgrade for more comfort. I went with the HyperX Cloud Pro headset back in 2018. I snagged that for $75 on Amazon. It was double the price of the cheap one, but worth every penny. Much better comfort, build quality, sound quality, etc. That headset lasted me over 2 years and then the microphone decided to crap out. I like gear so I decided to look into replacing the headset and retiring the Cloud Pro from gaming use to more casual music use or something. Anyway, on to the review...So the JBL Quantum 300 is $60 at the time of this review. I looked at a lot of headsets around this price range. I didn't want to spend over $100 because I was satisfied with my previous Cloud Pro's which were under $100, so I figured I would stay within the $50-$75 range. The JBL's are relatively new, and I have a lot of other JBL audio equipment that I love. So I found the Quantum 300 and it ticked off all the feature boxes for me, and the price was right. I figured a $60 headset would be roughly equivalent to my previous HyperX headset. They are not on the same level. Here are the main issues:- Comfort: Most of the head strap is plastic. You get a little bit of foam that contacts your head. But compared to the Cloud headset and my cheap $30 headset, the JBL is more towards the cheaper side of comfort. The size of the ear cups is a bit too small for me. Again, this is exactly what I experienced with my first $30 headset. My ears don't stick out more than normal, but in the JBL's my ears lightly tough the inside screen. Not a big deal unless you are gaming for hours, where it can really start to be uncomfortable. No such issue with the HyperX Cloud that I have.- Build Quality: JBL's are in the same ball park as the cheap $30 headset I had. Not anywhere near the HyperX Cloud. It's a shame for $60. Everything is cheap plastic. The fabric on the ear pads is cheap. The headset is very light. They call that a feature, but it is most certainly not for reasons explained in the next point. The headphone wire is very thin, probably half the size that is on my Cloud headset. The individual speaker wires going to the drivers are exposed and cheaply glued down the inside edge of the headset. Just overall not what you would expect from something that costs more than $30.- You Can Hear the Cord: So the first thing I noticed when I put this headset on is the fact that you can hear the noise of the headphone cord brushing on your shoulder. It sort of echo's inside the ear pad when there is no audio playing on the headset. It's not noticeable when gaming with sound, but for any quiet scenes, any slight movement where the cord brushes against your t-shirt will be heard. I put back on my Cloud headset and this was not an issue. It comes back to build quality. The JBL's are nothing but hollow plastic with no sound deadening or dampening. So any vibrations on the cord are transferred to the plastic shell and allowed to reverberate. With better quality headsets they use things like rubber and other materials in key areas to kill those external noise sources. Again, this is something you expect from the $30 headsets on Amazon, not a $60 name brand JBL.- Sound and Mic Quality: Sound quality is not terrible, but not on the level of the Cloud headset I have. It's certainly better than the $30 headset I had before. But compared to the Cloud, the bass isn't full, and the imaging isn't as good. Good imaging means it doesn't feel like the sound is coming from speakers. The drivers should just blend in and sound should sound like it's coming naturally to your ears. With the JBL's it's more \"forced\" and you just feel like a driver is playing right next to your ear (because it is, but that's not the point). The microphone is probably the best thing about this headset. It's not detachable which is a shame. But quality was standard and what I would expect at this price range.Overall, you need to pass on the JBL Quantum line of headsets. They need to be selling the Quantum 300 at $40 and not $60, because that is what it performs at. For $60 you can get way more. Here are my recommendations for what is on Amazon right now:$69 HyperX Cloud Corehttps://www.amazon.com/HyperX-Cloud-Core-Detachable-Cancelling/dp/B08HQW9SGP/ref=sr_1_3?dchild=1&keywords=hyperx+cloud+core&qid=1612537260&s=electronics&sr=1-3$59 HyperX Cloud Core Refurb - this is exactly the model I bought, it used to be called Cloud Pro. It's \"renewed\" but a headset that is twice as good as the JBL for the same pricehttps://www.amazon.com/HyperX-Headset-KHX-HSCC-BK-Certified-Refurbished/dp/B07F19BF8F/ref=sr_1_7?dchild=1&keywords=hyperx+cloud+core&qid=1612537301&s=electronics&sr=1-7$69 HyperX Cloud - again, this is the older Cloud model but basically the exact model I bought in 2018. Twice as good as the JBL, and brand new, for $9 more dollarshttps://www.amazon.com/HyperX-Cloud-Gaming-Headset-Entertainment/dp/B07FFK13RY/ref=sr_1_12?dchild=1&keywords=hyperx+cloud+core&qid=1612537301&s=electronics&sr=1-12",
    "date": "Reviewed in the United States on February 5, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Amir MZTE",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's great for the price!",
    "content": "The JBL headset is really comfortable and sound quality is nice for it's price. It lasted me around 8 months until I broke the headset because of it's plastic material. The only con that I had with it was the material of the headset itself everything else was great. The microphone was clear and decent.The Headsets very light most likely due to the Build quality which isn't entirely bad. The Clamping force is stronger than usual but it is still comfortable.",
    "date": "Reviewed in the United States on June 12, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "aint got time for that",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Microphone sound quaity is horrible",
    "content": "Used with the JBL software these headphones are adequate, bordering on good.  The microphone quality is horrible.  I bought these headphones for gaming and I am always with my team and there has always been the issue of, OMG you are too loud and full of static!, or I can't hear you and you are full of static. Adjusting the slider either doesn't work or is so sensitive that people cannot hear me at 4 or blasting their ears at 5.  And there are 30 more notches I could go.  Or can't hear you at 20 and too loud at 15.  Unfortunately I didn't decide soon enough to return these at the 30 day mark because the last couple months I have been playing with team mates sitting next to me so microphones were unnecessary.  Now, it is critical.So beware, find out before the 30 expiration date if your headphones are actually what you will be happy with.  I disconnected mine, grabbed  a cheap pair and they work just fine.I just wish I could exchange these or get a refund or at least an apology for a bad item quality.Best of luck!",
    "date": "Reviewed in the United States on August 20, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Joseph",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best headset I have owned",
    "content": "I have gone through plenty of headsets through my years of gaming and I will honestly with confidence say these are the best I have ever owned.All sound is crisp and clear, the base packs a punch, the cord is made of a fabric type material which means its not rubber and wont just randomly snap and helps with the tangling, fits nicely and is not too heavy. The cord is quite long as well, personally I like that because I can get up and shut my door that's half way across the room without having to take off my headset.The best part is you can hear direction accurately. I cannot tell you how many headsets advertise that their product supports that feature but 95% of the time it doesn't.I will also disclose which was not initially apparent is that this headset needs to install a program to help it run. Now, it is not a big or long install but the program can be played with in order to improve or modify the audio quality/settings. Well worth the purchase, ESPECIALLY if it is on sale.",
    "date": "Reviewed in the United States on March 5, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "cliff newman",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Glitchy",
    "content": "They seem great. But they tend to be glitchy. They just dont want to work 10% of the time. its weird.",
    "date": "Reviewed in the United States on September 23, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "TJ Olsen",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound but terrible Microphone",
    "content": "The sound on this headset is absolutely incredible however the microphone has some very agressive processing built in which results in your output audio having what  can  best be described as static in it's background and heavy handed limiting and compression.",
    "date": "Reviewed in the United States on August 21, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jeremy",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Over ear",
    "content": "Great product for my office calls. Fits over my ears and far more comfortable than on the ears.",
    "date": "Reviewed in the United States on August 11, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "This bridge worked perfectly on my Vantage bass.  It is a bit large but it covered the cavity left by the original bridge.  Worth the money, it’s fantastic.",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great headset",
    "content": "This is a great product.  It is really nice not having to worry about charging a battery.  It is powered from the Xbox controller.  It fits well and sounds good.  Very satisfied.",
    "date": "Reviewed in the United States on July 20, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Antoan Jeffries",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Not Great",
    "content": "Pretty much how the title suggests. You are basically paying for the brand. I bought these on Black Friday so they were discounted. I would not pay full price if you are thinking about getting them.Basic headphones with Volume control. Doesn't even have a mute function which you could find on cheaper sets.It's a tight fit around the ear so if you would like more space for your ear to breath then definitely don't get these eithe.TLDR- Buy when they are on sale only. Otherwise I recommend an entirely different brand that does the same thing. Only cost less.",
    "date": "Reviewed in the United States on December 23, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Frederick",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quite high quality",
    "content": "For its price these headphones give decent audio quality, the mic is very good as well. It’s alto decently durable, hasn’t broken even in a house with 5 users",
    "date": "Reviewed in the United States on June 10, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jack",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great headset to start with",
    "content": "I’ve bought these headphones multiple times, not because of durability, but as gifts to friends and my friends and I love them. Super comfortable, Great sounding, and has decent mic quality. The controls are easy to use and not complicated at all. The Cord is long and not bothersome at all. It’s a great headset overall.",
    "date": "Reviewed in the United States on April 13, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Justin",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really good",
    "content": "I like it a lot it fits me",
    "date": "Reviewed in the United States on June 29, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "BaneSword",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound, cheap construction",
    "content": "My first impression of these headphones is that they sound amazing, but are incredibly fragile. The mic arm feels like it could easily snap from the slightest amount of excess force (not to mention mutes by pushing the arm up rather than with a button), the wire feels thin with the jack at the end featuring an elbow connector just begging to break, and the plastic, while nice and lightweight, feels weak. My previous headphones were only $20 with great sound quality and durability that lasted 5 years. In comparison, these feel like they might break at any moment - not $80 material.They are great headphones if you manage to keep them safe, but I tend to be accident-prone and drop things frequently. If they manage to survive, I will update.EDIT - I have officially been using them for two months, and they still work great. Bumped them from 3 to 4 stars because they are more durable than I initially believed, but that doesn't stop me from worrying every time I accidentally stretch the wire.",
    "date": "Reviewed in the United States on December 2, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "luis enrique nino davila",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
    "content": "Excelente sonido",
    "date": "Reviewed in the United States on July 4, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Stephanie MBP",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gift",
    "content": "My nephew asked for this particular set of headphones.And he is a huge gamer.  I even verified that these were the correct ones.  They were.And he was just excited to get them on Christmas.  I haven't received any complaints from him.But he is tech savvy and wouldn't ask for an item like this without research.",
    "date": "Reviewed in the United States on January 15, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Steve",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gaming headphones",
    "content": "Got this for my nephew and he is happy with it.",
    "date": "Reviewed in the United States on June 2, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "D. Brent Harsh",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    *FANTASTIC* Customer Service from JBL!",
    "content": "These headphones are great.  Folks say they can hear me well, and a simple flip of the mic boom out of the way applies a physical \"mute\" by cutting off the input (so no messing about with figuring out which app you're currently using and where they've hidden/changed/moved/disguised the mute button *this* week...).The best part though was the service from JBL: about a week into this, I rolled over the cord with my desk chair, yanking the USB adapter right out of my desktop.  Fortunately no damage to the computer, but the USB dongle itself was destroyed.  I had another brand USB dongle from my previous headphones (which the headband had broken on, causing me to buy these JBLs) which \"sort of\" worked, but had a definite gain problem with the mic (everyone complained my volume was too low).  So my only solution was to get another JBL-branded matching USB dongle... so I called customer support, and they took my name and opened a ticket while they searched for the part - a day later, I got an e-mail saying they'd found the match, and that list price for the dongle was $40 but they would be complimentarily shipping me a replacement this time.  Totally my fault, physical accident and they came through - fantastic, unexpected, service.  Great job you guys!",
    "date": "Reviewed in the United States on April 26, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Gamut",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    All around solid, but doesn't work with Chromebooks, and the USB adaptor died",
    "content": "Overall these are a decent set of headphones, and about what I would expect for the price.  Sound fidelity for the earpieces is good and the and the mic pickup is also good... better than most cheaper headsets, but not fantastic to the point that I could rave about the value.  The mic arm is solid and stays where you put it.  The earpieces are soft and reasonably comfortable, but again, nothing to rave over.  There are more comfortable headsets.Amazon is asking me to rate the Sheerness of the headset, and they are bulky and not at all sheer.  They are reasonably light, but again, not unusually so.All around, it is a solid headset for a moderate price, but the main issue I've had with them is that I have tried them on three different Chromebooks (using the standard TRRS jack and not using the USB adapter) and all three Chromebooks (including different models) refuse to play sound on them properly.  Only one speaker comes through, and with a pinched and buzzing sound, and after a few seconds the Chromebooks automatically turns the volume level down to zero.  I don't have this problem on the Chromebooks with any other headsets I have tried, and I don't have this problem with the JBL headphones on a Mac, PC, Android or iOS device.  The headphone jack is undamaged and appears to be the correct size and with the rings in the proper position compared to other 1/8\" jacks.  No amount of cable wiggling changes the behavior.  It appears that the Chromebook hardware / software combo is detecting something about the impedance or other electrical configuration within the headset and refusing to use them as an ordinary headphone / mic combo.Update:  2020-10Up until now I had not been using the USB adaptor, but when I finally tried it, after about one hour the audio started cutting out in time with the blue indicator light blinking on and off, and then the sound and light went off completely and the USB adaptor never worked again.I also somehow manage to turn the volume knob on the back of the ear cup down to zero with my thumb every single time I place the headphones on my head and now just always make an extra motion with my thumb to turn it back up every time.Despite the headphones themselves having decent earpiece and mic quality when used via the TRRS jack, there are just too many issues with them to recommend.",
    "date": "Reviewed in the United States on August 30, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Kimberly",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perf Christmas present",
    "content": "My 8 yr old son loves these headphones, he originally asked for a switch headphone because his broke, but I saw this and immediately knew he had to have these, he opened his gift on Christmas Day and his face lit up, he tried them on right away and it worked perfect, the level of noise cancellation is perfect because I tried it too!",
    "date": "Reviewed in the United States on December 29, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "rwrand56",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The joints in these headphones is noisey",
    "content": "As long as you don't move you head or jaw they are fine. If you chew gum or try to listen to something while eating the creaking of the joints in the plastic heavily overpower the sounds that are supposed to be coming from the speakers.",
    "date": "Reviewed in the United States on February 3, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Claymore730 Claymore730",
    "rating": "2.0 out of 5 stars2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound, not a great connection.",
    "content": "5 months into owning this headset, the cat knocked the controller it was connected to off of a 1.5 foot high stool. The next day when I attempt to unplug the connector to check on it, it breaks off in the controller. Cue 45 minutes of irritation to get the broken piece out of the headphone port.The whole preceeding 5 months, the sound quality was amazing and the flip down mic was useful as well. Easy to adjust, and overall a very nice headset.",
    "date": "Reviewed in the United States on June 3, 2024",
    "verified": "Verified Purchase",
    "image_url": "https://m.media-amazon.com/images/I/81bsRYltneL._SY88.jpg"
  },
  {
    "author": "Greg Bumgardner",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Head phones.",
    "content": "Has really good sound.",
    "date": "Reviewed in the United States on May 6, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Mwilly",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    amazing headset",
    "content": "headset is surprisingly amazing and given the price it’s truly fantastic",
    "date": "Reviewed in the United States on April 2, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Paul",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’ll work, but not at full price",
    "content": "Get this in a sale and it’s fine.  Wiring is thing and worry-some, ear padding is stiff, but the sound is good and mic seems fine.  Not the most comfy, but I got it roughly 60% so a good set at that price.",
    "date": "Reviewed in the United States on November 24, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Laird Barron",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Durable",
    "content": "Good sound quality and serviceable mic. Unfortunately, the left earphone connecter (where the set adjusts for size) broke after about six months of use. Pretty disappointing to not even get a year of service out of an 80 dollar rig.",
    "date": "Reviewed in the United States on June 30, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Bryce",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good little tight",
    "content": "Great noise cancelation and mostly comfortable but sqeezes your head and long wire",
    "date": "Reviewed in the United States on March 4, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Daphne R.",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gift for my son",
    "content": "My son loves it.",
    "date": "Reviewed in the United States on April 14, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Engelbieth",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good audio",
    "content": "The are confortable, and the quality sound is good, the mic it lacks of definition but is clear, god quality of construction.",
    "date": "Reviewed in the United States on January 30, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jared lyon",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not loud enough",
    "content": "Sent them back for better wirelss pair not loud enough",
    "date": "Reviewed in the United States on February 29, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "William Bennett",
    "rating": "1.0 out of 5 stars",
    "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    UPDATED!!! STOP{PED WORKING",
    "content": "UPDATE!!!After 1 month the mic doesn't register. All input levels on device, device app, and app using for input are all at 100%. This head set was only kept on a headphone hook and cable free from snagging.  I was able to test without USB and it works better, but this was purchased to work via USB because not all applications recognize the 3.5mm difference between input and output.Buy something else!!!I bought these for dual purpose. I'm a casual gamer and wanted to be able to get online with my nephews to play games while using them for office meetings.  I couldn't find anything without ridiculous shapes/designs/colors or lights. I have nothing against those, but again I wanted one headset to facilitate both without breaking the bank. I would never use these to listen to music, but if you wanted a third option for an all in one these would work. I was disappointed that there wasn't a mute switch on the headphones or in the headsets line in, but what I got was so much better. Raising the microphone up mutes the microphone. bring it down... guess what... it unmutes! I have enjoyed this feature more than I ever thought I would.  The headset cable serves dual purpose. 3.5mm jack that plugs into an extension cable with USB on the end. If I pull out Nintendo Switch to play a game with fam I can unplug extension and go with the switch and not have a super long cable getting tangled up.  The ear cups are comfortable and I have been in meetings that have lasted 3 hours and didn't have ear fatigue. You wouldn't want to travel with this. They don't fold and don't come with a case or bag.Pros:ComfortablePRICEMutable micVolume knob on ear cupUSB & 3.5mm cableClean professional lookCons:Not the best sound qualityI wish I could hear myself speak while wearingThey don't foldDoesn't come with case/bagI wish the cable could be unplugged at headset so it could be replaced if damaged.I do recommend these for entry level gaming and or office video calls",
    "date": "Reviewed in the United States on December 28, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Brently Kirksey",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They do not last.",
    "content": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Bought them last November and the arm snapped when I put them on today.",
    "date": "Reviewed in the United States on August 7, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Heather Jenness",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for remote work and reducing background noise to help concentrate",
    "content": "I bought these because I needed a headset for my remote work zoom meetings. I also wanted something to block out the noise around the house so I can concentrate easier. I find myself where it is even without playing any music to help black background noise. They’re not noise canceling the black out enough so I’m not distracted. Extremely comfortable as well. Very pleased.",
    "date": "Reviewed in the United States on July 11, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Veronica",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Build Quality",
    "content": "For the Money I guess it is a good headset but some steelseries arctis 5 or 4's even are such a better alternative. After a little damage to the plastic frame connecting the headband to the ear cup where the wire is channeled through the right earcup totally broke, no audio at all. Mic is also REALLY quiet, or overly sensitive such as in zoom No one can hear me but in discord I'm fine. This issue doesn't derive from the mic sens. settings in those applications either its just the mic. In terms of comfort they're ok. From the looks of them the more expensive ones are obviously way more comfortable looking and  these headphones must be worn loose-ish if you don't want a headache. Besides many problems I have the audio quality is great and great for gaming its just the build quality and mic I have many problems with. Unlikely to buy again.",
    "date": "Reviewed in the United States on November 24, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Colin Severing",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing headphones",
    "content": "The Good : The headphones are optimized for PC use so the sound quality is much better when plugged into a PC using the USB adapter provided. The noise cancellation is great and the headphones are comfortable and lightweight. I can wear them for hours without any discomfort. The mic works great and the sound quality is amazing all around.The Bad : The wire that connects to the earpiece is fixed, so if the wire breaks, so do the headphones. Also, the swivel function of the earpieces is backwards - that is to say, when they swivel, they don't turn to rest facing upwards on the neck - so the swivel function is not useful.",
    "date": "Reviewed in the United States on February 16, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Brittany",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome Gaming Headset for Great Price",
    "content": "Ordered these as a Christmas gift for my brother, selected two-day shipping and they came when expected. They were on sale for half off so it was a great deal. My brother loved them & he let me try them out, the audio quality was awesome and they were comfortable. I guess noise cancellation works because we have to get his attention since he doesn’t hear us while he’s playing haha. Very satisfied with the product and service.",
    "date": "Reviewed in the United States on December 29, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Hunter",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Headset I've Ever Owned - No Joke!",
    "content": "This is worth the money!!! If you like gaming then you will love this headset. I have used lots of other headset products from Turtle Beach to Raycon and this takes the cake. I have had mine for a few months now and it is super comfy with such extremely good surround sound that I know where everyone is in a game. The microphone is great as well, cancelling background noise as well as being able to pick up your own voice when being quiet. It is flexible and though it may feel flimsy, I have had accidental tugs and drops very often and it hasn't effected the headset at all. I have never had a headset last this long without some kind of fault showing up. Just a side note, I use this for xbox and pc gaming and I do not know how it performs on other devices.",
    "date": "Reviewed in the United States on February 5, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Denise Pierce",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the price",
    "content": "I was surprised and impressed by the sound quality.  I was listening to music I know well and hearing things I’d never heard before. The microphone also does a great job at isolating only the speakers voice. Sometimes the audio gets static over it and I’m not sure why yet. Mixed feelings about the headset.",
    "date": "Reviewed in the United States on August 16, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Nightriderz20",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound and Comfortable!",
    "content": "Miss, Miss, Fail Fail. Without breaking my budget I bought cheaper headphones and just nothing was right. Sounds were ok but headset felt like I had a astronaut helmet on. This Jbl sound is crisp not heavy on bass but crisp quality sound that you want with just amount of bass. The main thing is I forget there on my head. I enjoy them",
    "date": "Reviewed in the United States on March 13, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Barb C",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Husband liked them",
    "content": "I bought these for my husband, he said they have good sound quality and cancel out surrounding noise very well. I gave sound quality 4 stars because I didn't actually hear them, but he said was good.",
    "date": "Reviewed in the United States on December 27, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Adan Rodriguez",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The heatset broke in 2 weeks",
    "content": "It breaks to easily",
    "date": "Reviewed in the United States on December 8, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "zuehld",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great for zoom",
    "content": "I use these for work while on zoom meetings.  works great!",
    "date": "Reviewed in the United States on December 4, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "wiegand",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love them and better than turtle beach!",
    "content": "They are great, we purchased two pair also has cables for USB hook up so the kids do school next to each other with the head phones in their laptops and then later we play on the ps4.  Love the mic.  If you put it up it is off.  If you put it down it is on.  JBL is the way to go.  I want to get the higher end version.  These are better than our turtle beach that we paid alot more for.",
    "date": "Reviewed in the United States on April 14, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "StevieRayVaughn4Life",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Low Volume",
    "content": "I picked up one of these headsets to play online games with my nephews after using their equipment over the holidays. Unfortunately, the headset just lacks output. Even when the volume is all the way up, you can barely hear the other players in the game. This model is about half of the volume of whatever headsets I've used before. We expected more from JBL.",
    "date": "Reviewed in the United States on December 29, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Big Mike",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Comfortable fit, mute option isn't very good",
    "content": "The overall comfort and sound quality on these headphones is much better than I'm typically used to (mid-range Logitech, etc). Very good aesthetics as well and the volume control is cleverly placed.My main issue is the mute feature, where you lift the microphone up and it auto mutes the mic. This is super clever but the mic is held in place by friction. Moving the mic up and down causes this horrible screeching sound that everyone I game with complains about since it reverberates through the microphone arm. I'm considering lubricating the arm but afraid that it could break down the plastics or interfere with internal components.Also the fit is a bit awkward, seems like it is always trying to fall forward off of my head.",
    "date": "Reviewed in the United States on July 16, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Michael J Braden",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound for the price",
    "content": "Best headset for the Black Friday sale.",
    "date": "Reviewed in the United States on November 22, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Adam Christopher Lay",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    they have great sound quality",
    "content": "love these headphones i use them on pretty much every game",
    "date": "Reviewed in the United States on February 12, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Enyo",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mic Gave out after 8 months",
    "content": "The headset was working just fine until yesterday mid-game the mic just died. Otherwise, the headset was working fine, and the sound quality was fine but the noise canceling kinda sucked. I can still use the headphones for listening to stuff I just cannot use the mic anymore.",
    "date": "Reviewed in the United States on March 3, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Lisa C.",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Comfortable for long periods!!",
    "content": "Too much pressure on head after gaming a while, very questionable build quality, they feel anything but solid. Save your money. Wish i had.I generally have had good luck with JBL, bummer.",
    "date": "Reviewed in the United States on February 9, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "JS",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    How do they put so much Bass into these Headphones!!",
    "content": "Sound quality is good, Noise canceling is good but the bass makes these headphones seem much bigger than they are. over all very happy with this purchase. I would recommend these.",
    "date": "Reviewed in the United States on March 6, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Ray",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good enough",
    "content": "It is a very good headset, but it’s pc drivers have some problems with Discord. Every time you join a voice chat in Discord it will stop working. That is very annoying. Overall, don’t buy jbl headphones if you want to game on pc. Go for hyper x or logitech. They know what they are doing.",
    "date": "Reviewed in the United States on December 31, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "NettyBoo",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great sound but no one can hear you speak.",
    "content": "That overall comfort and design are excellent, they seem very durable and well built. The sound quality is also very good and with the included software fine tuning is fast and easy. Now for the bad news, this is a gaming and communication device and the microphone has a very difficult time picking up sounds of lower tones such as tenor or baritone and is probably best used by squeakers (people with high pitched voices). My husband was curious how well these would work doing online demonstrations and streaming , but because he has an adults voice it barely picks up anything, which caused some embarrassing issues during a live presentation.",
    "date": "Reviewed in the United States on December 26, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Travis J",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for price",
    "content": "Great budget friendly, entry level gaming headset. For stereo sound its good. Crisp. The mic is flawless and has very little echo. I love that if the boom is up the mic is muted.All in all good product.",
    "date": "Reviewed in the United States on August 7, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Shree",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better sound and voice clarity",
    "content": "Have been using it for almost a week for MP and its works really well. The surround sounds gives you the sound effect you would expect, like enemies coming from behind ;)  The headphones fit snug on your ears (i have big ears) and are quite comfortable and they cancel out the noise (passive ofc)",
    "date": "Reviewed in the United States on August 28, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "D. Swenson",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Headphones work great, mic is a little too quiet.",
    "content": "The headphones are nice and comfortable. They seem to be high quality. The microphone is a little too quiet, and there doesn't seem to be anything that can be done via software to improve things. Overall I am happy with these - but I probably won't by this model again.",
    "date": "Reviewed in the United States on February 1, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "denae hinds",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap wires",
    "content": "My son has used this a few times and wires are already bent around the plug-in area and the sound isn’t working. I expected more from JBL. His cheaper headsets have lasted much longer.",
    "date": "Reviewed in the United States on January 13, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Mstrayale",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Christmas Gift",
    "content": "Got this for my brother in law for Christmas. His old ones broke and was thrilled to have gotten these. He loves it! It’s a great quality for the price.",
    "date": "Reviewed in the United States on December 27, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Simon",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Online Lecture Success",
    "content": "I wish the noise cancelling was better; 4 Star would have been a 5.Some students said the mic quality was lacking.",
    "date": "Reviewed in the United States on February 25, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Deuce",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sound",
    "content": "The sound for gaming is not as good as other headsets I’ve had still a very good item however everything sounds muffled",
    "date": "Reviewed in the United States on May 26, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jacki Tramp",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Battery Headphones",
    "content": "I liked these JBL gaming headphones the most because they don't have a rechargeable battery. I didn't want to have to charge both my controller and headphones, it just seems redundant for a casual gamer.I can plug them right into my Xbox Controller, my Nintendo Switch Dock by (included) USB, or the top of the Nintendo Switch when it's handheld and it's great sound quality.",
    "date": "Reviewed in the United States on March 24, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Phillips",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
    "content": "This is the second JBL set I've owned and very good soud and quality.",
    "date": "Reviewed in the United States on June 21, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Nehemiah Crutcher",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review",
    "content": "Good quality",
    "date": "Reviewed in the United States on October 2, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Denise",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unreliable Sound",
    "content": "When audio from a new window or a window that has not output audio for a while tries to do so, the first seconds of the sound are not played. Furthermore, when used for more than two hours at a time, sound cuts out frequently for up to half of a second.All other features work as intended. It is comfortable and the noise cancellation is good. It is unfortunate that it fails as a piece of audio equipment otherwise.",
    "date": "Reviewed in the United States on March 29, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Dan",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great headset... until a week later the cord starts failing",
    "content": "This headset was great for a very short amount of time. Within under a week, I started noticing that if you wiggle the cord just a bit, you start losing sound. If this is happening within my first week of owning the headset, then I can't imagine it'll survive another couple of months. Unfortunately you cannot detach the cord and get a replacement, so once the cord is done, I'll need to buy a new headset. 3-stars is as generous of a rating as I can give it.",
    "date": "Reviewed in the United States on January 11, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Shani",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It the best",
    "content": "Was not the best quality at all",
    "date": "Reviewed in the United States on July 2, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Bancroft A Bryan",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    On time thanks keep up the good work.",
    "content": "Music and sound",
    "date": "Reviewed in the United States on September 9, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Josh",
    "rating": "1.0 out of 5 stars",
    "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not work at all",
    "content": "Straight out of the box they did not work. Last time buying jbl.",
    "date": "Reviewed in the United States on August 22, 2024",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Kevin Shegani",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
    "content": "Great product. Really enjoy the feel of surround sound. I do not like that the cord is attached to the headphones, however. It offers some noise cancellation but if that is something that you are specifically looking for then I would look at the higher end models for this line of headphones. These are light and made of soft material so they can be worn for a long time with little discomfort.",
    "date": "Reviewed in the United States on August 11, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Walter WhiteWalter White",
    "rating": "3.0 out of 5 stars3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent value!",
    "content": "Clear crisp highs and nice bass without being overwhelming. The software it comes with is top notch. I use them for PC gaming and can hear my enemies in games like PUbg, Wazone, etc. They're about as comfortable as other headsets I've used too.Edit after one month: having serious software issues when the headset is plugged in, there will be no sound and I have unplug and plug it back in to correct the problem. NOT acceptable",
    "date": "Reviewed in the United States on July 18, 2020",
    "verified": "Verified Purchase",
    "image_url": "https://images-na.ssl-images-amazon.com/images/I/619nvA50kOL._SY88.jpg"
  },
  {
    "author": "Ricardo AlbertoRicardo Alberto",
    "rating": "3.0 out of 5 stars3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Si están en ofertade 40 -50$ como los compré  vale la pena , sino ir por unos gama alta .",
    "content": "Se siente bien el sonido , aunque el cable es muy corto. Las almohadillas son  blandas ,Para disfrutar de toda la calidad de sonido hay que conectar el amplificador USB que trae ,No se sienten de calidad aún cuando el sonido es bueno. Hay mejores opciones cumplen con el 60% de lo que dice la descripción .Deberian ser mejor opción los quantun 400 y  600 .Aunque para jugar están bien.",
    "date": "Reviewed in the United States on November 21, 2020",
    "verified": "Verified Purchase",
    "image_url": "https://images-na.ssl-images-amazon.com/images/I/81YRGK-edRL._SY88.jpg"
  },
  {
    "author": "K. Boer",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great option",
    "content": "Actually bought for the kids that are gone doing school online.  Wanted to give them less distractions by not hearing the rest of us while they were trying to do school work.Works great!",
    "date": "Reviewed in the United States on January 5, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Daniel Kolossos",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Honestly not ideal",
    "content": "Look somewhere else for audio quality, don't bother if you don't have a mixer its an L.",
    "date": "Reviewed in the United States on December 13, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Michael",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing",
    "content": "These headphones are insane. It feels like your in a home theater and when I first used the mic my friends were jealous. They are a little tight on the jaw but you can wear these for hours. There is no noise canceling but the surround sounds makes up for it and makes it feel like there is noise cancellation.",
    "date": "Reviewed in the United States on July 31, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Thrifty 50",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was a perfect gift for a video gamer",
    "content": "They're great for gaming, the sound quality is great,and the noise cancelation works wonderfully.",
    "date": "Reviewed in the United States on October 30, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "ChaseChase",
    "rating": "1.0 out of 5 stars1.0 out of 5 stars",
    "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy these reason in review...",
    "content": "Im on my 2nd pair i will say these sound pretty good compared to my old headset ( some Chinese trash) when they work.I am on my 2nd pair because, if you like to plug this thing into anything more than once in its life than it will become destroyed before long the angle that this is at is unnecessary and a big flaw in its design. if it were strong it would be no problem both pairs of these broke in the same way. My Chinese headset still works at least. Also the software at least at this time is trash it struggles to detect the headset even when the computer can see it but that was with the 1st one my 2nd one that problem was fixed, it doesn't matter because they don't work anymore and i dont think i will ever buy a jbl headset ever again and one of the main reasons i bought this was because it was jbl. Also that 80 dollars isn't easy to get so i am beyond disappointed.",
    "date": "Reviewed in the United States on October 20, 2020",
    "verified": "Verified Purchase",
    "image_url": "https://images-na.ssl-images-amazon.com/images/I/614PLaC2EEL._SY88.jpg"
  },
  {
    "author": "Xurlok",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't freak out the mute is the Mic flipped up! You hear it.",
    "content": "Fantastic fantastic fantastic five stars all day these are by far the best purchase I have made hear a foot step much clearer now",
    "date": "Reviewed in the United States on March 29, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jesus",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good ones",
    "content": "I like how they feel though because they are so large they do get a bit heavy in extended sessions",
    "date": "Reviewed in the United States on August 9, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "BocMage",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good enough sound but smallish ear cups was a deal breaker for me and why i went back.",
    "content": "I expected some measure of quality and i got it, just got smallish fit that was immediately uncomfortable for me ears. Wanted to like them but just couldn't A good value (when they were half off) long as they fit you.I ordered 2 pairs and kept the knock off (mpow) as they fit better and honestly sound better.",
    "date": "Reviewed in the United States on November 17, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Jesus Garcia",
    "rating": "4.0 out of 5 stars",
    "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid head phones",
    "content": "The head phones work as intended. The surround sound is great, very comfortable and  overall quality is good aside from the flimsy mic.",
    "date": "Reviewed in the United States on November 27, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Angelique",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for multiple platform gaming",
    "content": "The headphones work great with the PS4 and the added USB adapter will be great with PC gaming as well, cutting down on the number of headphones I need. The braided cord is also great for less wear and tear on the cord. Fantastic price for such a good gaming headset",
    "date": "Reviewed in the United States on August 22, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Gus",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mic volume is very low.",
    "content": "It is comfortable to wear but the mic is very low. I maxed out mic volume and everyone still says it is very low. I am using it on different devices and I still get the same feedback - mic is low. I have to hold the mic really close to my mouth so others can hear me. It is very inconvenient. :(",
    "date": "Reviewed in the United States on September 16, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "ghstinshll",
    "rating": "3.0 out of 5 stars",
    "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sexy sound, microphone maybe defective?",
    "content": "Just doesnt pick me up like my Plantronics sets did. The mic arm needs moved to wake it up, and sometimes i have to use my 'radio voice' to be heard very well. I own a TON of JBL products and love them to death, but I figured this out w/ the 300 too late after my return window. Shoot! :(",
    "date": "Reviewed in the United States on September 28, 2020",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Manny",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing",
    "content": "Amazing product",
    "date": "Reviewed in the United States on July 7, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Cam",
    "rating": "1.0 out of 5 stars",
    "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    doesnt work out the box",
    "content": "they just dont work for 90% of my PC, if I get on discord and hop on a game with friends it works for calls, but im not getting any sound from youtube twitch any games, ill go to sound settings and make my mic the main device for sound, ill unplug my mic and my speakers and remove them from the PC settings, still nothing, go buy logitech, if you need a speaker JBL is the king, gaming headsets? tape some cheap speakers to a helmet or something, those will do better",
    "date": "Reviewed in the United States on November 25, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "bob f.",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    JBL 300 headphones, wired!",
    "content": "Extreme sound quality, comfortable fit, great price!",
    "date": "Reviewed in the United States on January 29, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "j man",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good",
    "content": "My 8 year old loves them with his nintendo",
    "date": "Reviewed in the United States on December 30, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Logan",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mic Picks Up EVERYTHING",
    "content": "This Headset is OK, unless you are playing a multiplayer game—the Mic pics up everything, including the sound to your headset. Your gaming party will hate you because they will be hearing everything twice, and you will be frustrated trying to fix the problem, but you can do nothing. I would look for an alternative headset.",
    "date": "Reviewed in the United States on March 11, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Nyy",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn’t last long",
    "content": "They sound great but I only bought them in September and it’s December now, they’re broken.",
    "date": "Reviewed in the United States on December 6, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "chase",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good budget headset",
    "content": "Really like the headset and audio is great money well spent",
    "date": "Reviewed in the United States on December 3, 2022",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "BluegreenBluegreen",
    "rating": "2.0 out of 5 stars2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't last under light usage",
    "content": "Got these to work from home, and needed the noise cancellation due to other family members working/going to school in the same space. They worked great sound wise, the mic was good, and I was happy overall. However, there were sometimes clicks where the plastic in the earpiece met the band when I spoke, which was annoying but minor. Not after a year of ownership, though, the bracket beneath the band that holds the earpiece to the band just split. I picked it up, and it just split. These have not been beaten on or abused. They stayed at my desk and were only worn for calls and music for a max of 2-3 hours/day.",
    "date": "Reviewed in the United States on February 19, 2021",
    "verified": "Verified Purchase",
    "image_url": "https://images-na.ssl-images-amazon.com/images/I/71nDsB54N7L._SY88.jpg"
  },
  {
    "author": "Mike",
    "rating": "2.0 out of 5 stars",
    "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great audio, but if you talk to people online, they can hear anything you hear.",
    "content": "Unfortunately these just don't cut it and there is no fix online. If I am talking to buddies online as I'm gaming or watching videos, they can hear clearly exactly what I am hearing. In order for it not to happen, you have to turn the volume down so much, it's not worth listening to at that point. Waste of money.",
    "date": "Reviewed in the United States on January 11, 2023",
    "verified": "Verified Purchase",
    "image_url": null
  },
  {
    "author": "Rocky R.",
    "rating": "5.0 out of 5 stars",
    "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
    "content": "Excellent sound quality for price and great over ear comfort for those long gaming sessions. Noise cancellation could be slighty improved but I still feel I got more then what paid for... in a good way.",
    "date": "Reviewed in the United States on February 12, 2021",
    "verified": "Verified Purchase",
    "image_url": null
  }
]